{
  "basics": {
    "name": "Fahim Hafiz",
    "label": "Lecturer, CSE",
    "image": "",
    "email": "fahimhafiz@.cse.uiu.ac.bd",
    "url": "https://fahimhafiz.github.io/"
  },
  "education": [
    {
      "institution": "United International University",
      "department": "Department of CSE",
      "location": "Dhaka, Bangladesh",
      "url": "https://www.uiu.ac.bd/",
      "area": "Computer Science",
      "studyType": "MSc",
      "startDate": "2023",
      "endDate": "2025"
    },
    {
      "institution": "Bangladesh University of Engineering and Technology(BUET)",
      "department":"Department of EEE",
      "location": "Dhaka, Bangladesh",
      "url": "https://www.buet.ac.bd/",
      "area": "Electrical and Electronic Engineering",
      "studyType": "BSc",
      "startDate": "2016",
      "endDate": "2021"
    }
  ],
  "work": [
    {
      "name": "Department of CSE, United International University(UIU), Dhaka, Bangladesh",
      "position": "Lecturer",
      "url": "https://www.uiu.ac.bd/",
      "startDate": "2022",
      "endDate": ""
    },
    {
      "name": "Department of ECE, North South University(NSU), Dhaka, Bangladesh",
      "position": "Research Assistant",
      "url": "https://www.northsouth.edu/",
      "startDate": "2022",
      "endDate": ""
    },
    {
      "name": "Department of EECE, Military Institute of Science and Technology(MIST), Dhaka, Bangladesh",
      "position": "Lecturer",
      "url": "https://mist.ac.bd/",
      "startDate": "2021",
      "endDate": "2022"
    }
  ],
  "Extracurricular Activities": [
    {
      "organization": "UIU Robotics Club",
      "location": "Bangladesh",
      "position": "Moderator",
      "url": "https://robotics.uiu.ac.bd/",
      "startDate": "2023",
      "endDate": "",
      "summary": "Currently overseeing the responsibilities of UIU Robotics Club"
    },
    {
      "organization": "Department of CSE, UIU",
      "location": "Bangladesh",
      "position": "Project Show Organiser",
      
      "startDate": "2023",
      "endDate": "",
      "summary": "Organizing ’CSE Project Show’ in each trimester at UIU where 1000+ students participate in different lab courses such as: Microprocessors and Microcontrollers Lab, Electronics Lab, AOOP, DBMS, Software Engineering Lab, etc."
    },
    {
      "organization": "BADHAN",
      "location": "Bangladesh",
      "position": "Vice President of the Nazrul Islam Hall, BUET",
      "url": "https://www.badhan.org/",
      "startDate": "2019",
      "endDate": "2020",
      "summary": "BADHAN is a voluntary blood donors’ organization expanded among the Graduate and Post-Graduate level educational institution of Bangladesh."
    }
  ],
  "awards and certificates": [
    {
      "title": "AI in Public Health Workshop",
      "date": "2024",
      "awarder": "Child Health Research Foundation, Bangladesh",
      "summary": "Workshop on time series forecasting using Deep Learning Methods."
    },
    {
      "title": "1st Runner Up in MATLAB Competition",
      "date": "2019",
      "awarder": "Bangladesh University of Engineering and Technology(BUET)",
      "summary": "EEE Day-2019 arranged a Inter-university MATLAB compeition where I became 1st Runner Up."
    },
    {
      "title": "Dean's List",
      "date": "2017, 2018, 2019, 2020, 2021",
      "awarder": "Bangladesh University of Engineering and Technology(BUET)",
      "summary": "Consecutive CGPA above 3.75 gets Deans List award."
    }

  ],
  "publications": [
    {
      "name": "ENRNN-AU-Net: A Hybrid Deep Learning Model to Classify and Segment Histopathology Images of Breast Cancer",
      "publisher": "IEEE",
      "releaseDate": "2024",
      "url": "https://ieeexplore.ieee.org/abstract/document/10499623",
      "summary": "Breast cancer is a complicated and diverse ailment that requires thorough understanding at the cellular level to provide more accurate diagnoses and customized treatments. This work explores the categorization and division of breast cancer cells using imaging technology, computational algorithms, and histopathology examination. The classification result was derived by building a hybrid model that combined RNN and EfficientNetV2S with an accuracy of 99.99%, the model demonstrated promising improvement over the baseline, even though it acknowledged the influence of sparse data on outcomes. On the other hand, the segmentation result was derived by modifying the pre-trained model “U-Net” with an attention mechanism where the model was also able to achieve a significant accuracy of 99.54%.To achieve an understanding of the many subtleties of breast cancer, this study emphasizes the significance of classifying and segmenting cells at the individual cell level. It is possible to achieve a thorough understanding by using deep learning and machine learning models on image data."
    },
    {
      "name": "MosquitoFusion: A Multiclass Dataset for Real-Time Detection of Mosquitoes, Swarms, and Breeding Sites Using Deep Learning.",
      "publisher": "ICLR-24",
      "releaseDate": "2024",
      "url": "https://arxiv.org/pdf/2404.01501",
      "summary": "In this paper, we present an integrated approach to real-time mosquito detection using our multiclass dataset (MosquitoFusion) containing 1204 diverse images and leverage cutting-edge technologies, specifically computer vision, to automate the identification of Mosquitoes, Swarms, and Breeding Sites. The pre-trained YOLOv8 model, trained on this dataset, achieved a mean Average Precision (mAP@50) of 57.1%, with precision at 73.4% and recall at 50.5%. The integration of Geographic Information Systems (GIS) further enriches the depth of our analysis, providing valuable insights into spatial patterns. "
    }
  ],
  "languages": [
    {
      "language": "Bengali",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "Research Interests": [
    {
      "name": ["Machine Learning", "IoT", "Health Informatics", "Computer Vision", "HCI"]
    }
  ],
  "projects": [
    {
      "name": "Designing Microprocessor Lab and Network Lab Project Manual using Raspberry Pi (ongoing)",
      "summary": "We are working on building a repository that any student can follow to implement complex engineering problems utilizing Microcontrollers, and sensors as well as build IoT-based Systems. You can see the detailed implementation strategy once our paper regarding this project is published online which is under review now. In the Microprocessors and Microcontrollers Lab design part, we have created these 4 experiments: 1) Interfacing of Gas Sensor using Arduino & Showing the Sensor Data in OLED Display. 2) Wi-Fi communication and building IoT-based systems using Arduino and XAMPP/Arduino IoT Cloud. 3) Introduction to Raspberry Pi (Gen 4 Model B/B+). 4) Image/Video Processing and Object Detection using Raspberry Pi.",
      "startDate": "2023",
      "endDate": "",
      "url": "https://docs.google.com/document/d/1Yikhq6t8Z1vf5S9fGLZNfprAflVTXtTD-OHA3s7RRAU/edit?usp=sharing"
    },
    {
      "name": "Hand Gesture Controlled Robotic Arm Using EMG Sensor",
      "summary": "We utilized EMG sensors to measure small electrical signals generated by muscles to mimic the control of the actual hand using a prototype robotic hand. The EMG sensor connected to the human hand can pick up the muscle movement and send similar instructions to a robotic hand that can replicate the similar movement performed by the actual hand.",
      "startDate": "2018",
      "endDate": "2019"
    },
    {
      "name": "Face Recognition based door lock system using Raspberry Pi",
      "summary": "In this project, we controlled the opening of a door and lighting a light using Raspberry Pi. When Raspberry Pi detects a face, then it applies machine learning algorithms to decide if it is the face of a known person or not. The known persons are trained persons which visible in UI and their access in the room can be controlled with a checkbox. A person can only enter only if his face is known to the database and the relevant person's permission is granted in the control panel.",
      "startDate": "2018",
      "endDate": "2019",
      "url": "https://www.youtube.com/watch?v=DI_ETO_g7pw"
    }
    
  ]
}
