{
  "basics": {
    "name": "Fahim Hafiz",
    "label": "Lecturer, CSE",
    "image": "",
    "email": "fahimhafiz@.cse.uiu.ac.bd",
    "url": "https://fahimhafiz.github.io/"
  },
  "education": [
    {
      "institution": "United International University",
      "department": "Department of CSE",
      "location": "Dhaka, Bangladesh",
      "url": "https://www.uiu.ac.bd/",
      "area": "Computer Science",
      "studyType": "MSc",
      "startDate": "2023",
      "endDate": "2025"
    },
    {
      "institution": "Bangladesh University of Engineering and Technology(BUET)",
      "department":"Department of EEE",
      "location": "Dhaka, Bangladesh",
      "url": "https://www.buet.ac.bd/",
      "area": "Electrical and Electronic Engineering",
      "studyType": "BSc",
      "startDate": "2016",
      "endDate": "2021"
    }
  ],
  "work": [
    {
      "name": "Department of CSE, United International University(UIU), Dhaka, Bangladesh",
      "position": "Lecturer",
      "url": "https://www.uiu.ac.bd/",
      "startDate": "2022",
      "endDate": ""
    },
    {
      "name": "Department of ECE, North South University(NSU), Dhaka, Bangladesh",
      "position": "Research Assistant",
      "url": "https://www.northsouth.edu/",
      "startDate": "2022",
      "endDate": ""
    },
    {
      "name": "Department of EECE, Military Institute of Science and Technology(MIST), Dhaka, Bangladesh",
      "position": "Lecturer",
      "url": "https://mist.ac.bd/",
      "startDate": "2021",
      "endDate": "2022"
    }
  ],
  "Extracurricular Activities": [
    {
      "organization": "UIU Robotics Club",
      "location": "Bangladesh",
      "position": "Moderator",
      "url": "https://robotics.uiu.ac.bd/",
      "startDate": "2023",
      "endDate": "",
      "summary": "Currently overseeing the responsibilities of UIU Robotics Club"
    },
    {
      "organization": "Department of CSE, UIU",
      "location": "Bangladesh",
      "position": "Project Show Organiser",
      
      "startDate": "2023",
      "endDate": "",
      "summary": "Organizing ’CSE Project Show’ in each trimester at UIU where 1000+ students participate in different lab courses such as: Microprocessors and Microcontrollers Lab, Electronics Lab, AOOP, DBMS, Software Engineering Lab, etc."
    },
    {
      "organization": "Department of CSE, UIU",
      "location": "Bangladesh",
      "position": "CSE FEST 2025 Organiser",
      
      "startDate": "2024",
      "endDate": "2025",
      "summary": "Robotics Segment Coordinatior and Treasurer at the CSE FEST-2025"
    },
    {
      "organization": "BADHAN",
      "location": "Bangladesh",
      "position": "Vice President of the Nazrul Islam Hall, BUET",
      "url": "https://www.badhan.org/",
      "startDate": "2019",
      "endDate": "2020",
      "summary": "BADHAN is a voluntary blood donors’ organization expanded among the Graduate and Post-Graduate level educational institution of Bangladesh."
    }
  ],
  "awards and certificates": [
    {
      "title": "AI in Public Health Workshop",
      "date": "2024",
      "awarder": "Child Health Research Foundation, Bangladesh",
      "summary": "Workshop on time series forecasting using Deep Learning Methods."
    },
    {
      "title": "1st Runner Up in MATLAB Competition",
      "date": "2019",
      "awarder": "Bangladesh University of Engineering and Technology(BUET)",
      "summary": "EEE Day-2019 arranged a Inter-university MATLAB compeition where I became 1st Runner Up."
    },
    {
      "title": "Dean's List",
      "date": "2017, 2018, 2019, 2020, 2021",
      "awarder": "Bangladesh University of Engineering and Technology(BUET)",
      "summary": "Consecutive CGPA above 3.75 gets Deans List award."
    }

  ],
  "publications": [
    {
      "name": "ENRNN-AU-Net: A Hybrid Deep Learning Model to Classify and Segment Histopathology Images of Breast Cancer",
      "publisher": "IEEE",
      "releaseDate": "2024",
      "url": "https://ieeexplore.ieee.org/abstract/document/10499623",
      "summary": "Breast cancer is a complicated and diverse ailment that requires thorough understanding at the cellular level to provide more accurate diagnoses and customized treatments. This work explores the categorization and division of breast cancer cells using imaging technology, computational algorithms, and histopathology examination. The classification result was derived by building a hybrid model that combined RNN and EfficientNetV2S with an accuracy of 99.99%, the model demonstrated promising improvement over the baseline, even though it acknowledged the influence of sparse data on outcomes. On the other hand, the segmentation result was derived by modifying the pre-trained model “U-Net” with an attention mechanism where the model was also able to achieve a significant accuracy of 99.54%.To achieve an understanding of the many subtleties of breast cancer, this study emphasizes the significance of classifying and segmenting cells at the individual cell level. It is possible to achieve a thorough understanding by using deep learning and machine learning models on image data."
    },
    {
      "name": "MosquitoFusion: A Multiclass Dataset for Real-Time Detection of Mosquitoes, Swarms, and Breeding Sites Using Deep Learning.",
      "publisher": "ICLR-24",
      "releaseDate": "2024",
      "url": "https://arxiv.org/pdf/2404.01501",
      "summary": "In this paper, we present an integrated approach to real-time mosquito detection using our multiclass dataset (MosquitoFusion) containing 1204 diverse images and leverage cutting-edge technologies, specifically computer vision, to automate the identification of Mosquitoes, Swarms, and Breeding Sites. The pre-trained YOLOv8 model, trained on this dataset, achieved a mean Average Precision (mAP@50) of 57.1%, with precision at 73.4% and recall at 50.5%. The integration of Geographic Information Systems (GIS) further enriches the depth of our analysis, providing valuable insights into spatial patterns. "
    },
    {
      "name": "Design of a Microprocessors and Microcontrollers Laboratory Course Addressing Complex Engineering Problems and Activities.",
      "publisher": "Computer Applications in Engineering Education",
      "releaseDate": "2025",
      "url": "https://doi.org/10.1002/cae.70006",
      "summary": "This paper proposes a novel curriculum for the microprocessors and microcontrollers laboratory course. The proposed curriculum blends structured laboratory experiments with an open-ended project phase, addressing complex engineering problems and activities. Microprocessors and microcontrollers are ubiquitous in modern technology, driving applications across diverse fields. To prepare future engineers for Industry 4.0, effective educational approaches are crucial. The proposed lab enables students to perform hands-on experiments using advanced microprocessors and microcontrollers while leveraging their acquired knowledge by working in teams to tackle self-defined complex engineering problems that utilize these devices and sensors, often used in the industry. Furthermore, this curriculum fosters multidisciplinary learning and equips students with problem-solving skills that can be applied in real-world scenarios. With recent technological advancements, traditional microprocessors and microcontrollers curricula often fail to capture the complexity of real-world applications. This curriculum addresses this critical gap by incorporating insights from experts in both industry and academia. It trains students with the necessary skills and knowledge to thrive in this rapidly evolving technological landscape, preparing them for success upon graduation. The curriculum integrates project-based learning, where students define complex engineering problems for themselves. This approach actively engages students, fostering a deeper understanding and enhancing their learning capabilities. Statistical analysis shows that the proposed curriculum significantly improves student learning outcomes, particularly in their ability to formulate and solve complex engineering problems, as well as engage in complex engineering activities."
    },
    {
      "name": "GBDTSVM: Combined Support Vector Machine and Gradient Boosting Decision Tree Framework for efficient snoRNA-disease association prediction.",
      "publisher": "Computers in Biology and Medicine",
      "releaseDate": "2025",
      "url": "https://doi.org/10.1016/j.compbiomed.2025.110219",
      "summary": "Small nucleolar RNAs (snoRNAs) are increasingly recognized for their critical role in the pathogenesis and characterization of various human diseases. Consequently, the precise identification of snoRNA-disease associations (SDAs) is essential for the progression of diseases and the advancement of treatment strategies. However, conventional biological experimental approaches are costly, time-consuming, and resource-intensive; therefore, machine learning-based computational methods offer a promising solution to mitigate these limitations. This paper proposes a model called ‘GBDTSVM’, representing a novel and efficient machine learning approach for predicting snoRNA-disease associations by leveraging a Gradient Boosting Decision Tree (GBDT) and Support Vector Machine (SVM). ‘GBDTSVM’ effectively extracts integrated snoRNA-disease feature representations utilizing GBDT, and SVM is subsequently utilized to classify and identify potential associations. Furthermore, the method enhances the accuracy of these predictions by incorporating Gaussian integrated profile kernel similarity for both snoRNAs and diseases. Experimental evaluation of the GBDTSVM model demonstrates superior performance compared to state-of-the-art methods in the field, achieving an AUROC of 0.96 and an AUPRC of 0.95 on the ‘MDRF’ dataset. Moreover, our model shows superior performance on two more datasets named ‘LSGT’ and ‘PsnoD’. Additionally, a case study conducted on the predicted snoRNA-disease associations verified the top-ranked snoRNAs across twelve prevalent diseases, further validating the efficacy of the GBDTSVM approach. These results underscore the model’s potential as a robust tool for advancing snoRNA-related disease research. Source codes and datasets for our proposed framework can be obtained from: https://github.com/mariamuna04/gbdtsvm."
    }
  ],
  "languages": [
    {
      "language": "Bengali",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "Research Interests": [
    {
      "name": ["Machine Learning", "IoT", "Health Informatics", "Computer Vision", "HCI"]
    }
  ],
  "projects": [
    {
      "name": "Designing Microprocessor Lab and Network Lab Project Manual using Raspberry Pi (ongoing)",
      "summary": "We are working on building a repository that any student can follow to implement complex engineering problems utilizing Microcontrollers, and sensors as well as build IoT-based Systems. You can see the detailed implementation strategy once our paper regarding this project is published online which is under review now. In the Microprocessors and Microcontrollers Lab design part, we have created these 4 experiments: 1) Interfacing of Gas Sensor using Arduino & Showing the Sensor Data in OLED Display. 2) Wi-Fi communication and building IoT-based systems using Arduino and XAMPP/Arduino IoT Cloud. 3) Introduction to Raspberry Pi (Gen 4 Model B/B+). 4) Image/Video Processing and Object Detection using Raspberry Pi.",
      "startDate": "2023",
      "endDate": "",
      "url": "https://docs.google.com/document/d/1Yikhq6t8Z1vf5S9fGLZNfprAflVTXtTD-OHA3s7RRAU/edit?usp=sharing"
    },
    {
      "name": "Enhancing Typing Speed and Ergonomics Through Optimal Keyboard Design: A Reinforcement Learning Approach (ongoing)",
      "summary": "This research tackles the problem of optimizing keyboard design for improved typing speed and ergonomics by employing reinforcement learning techniques. While existing keyboard layouts are often designed arbitrarily without following standardized approaches, this study aims to develop an optimal layout that maximizes typing efficiency and user comfort. Previous works have explored multi-objective function optimization and maintaining similarity with standard layouts using algorithms like Ant Colony Optimization, deep learning with genetic algorithms, and multi-objective optimization problems. However, accurate ergonomic criteria across different keyboard types and objective functions for optimal layout design remain unexplored. By considering the six ergonomic criteria proposed by Eggers et al. (2003) and leveraging reinforcement learning algorithms, we aim to apply reinforcement-based optimization methods to the keyboard design problem, paving the way for a more comprehensive and data-driven approach to optimizing keyboard layouts. This work is currently under review",
      "startDate": "2024",
      "endDate": ""
    },
    {
      "name": "Hand Gesture Controlled Robotic Arm Using EMG Sensor",
      "summary": "We utilized EMG sensors to measure small electrical signals generated by muscles to mimic the control of the actual hand using a prototype robotic hand. The EMG sensor connected to the human hand can pick up the muscle movement and send similar instructions to a robotic hand that can replicate the similar movement performed by the actual hand.",
      "startDate": "2018",
      "endDate": "2019"
    },
    {
      "name": "Face Recognition based door lock system using Raspberry Pi",
      "summary": "In this project, we controlled the opening of a door and lighting a light using Raspberry Pi. When Raspberry Pi detects a face, then it applies machine learning algorithms to decide if it is the face of a known person or not. The known persons are trained persons which visible in UI and their access in the room can be controlled with a checkbox. A person can only enter only if his face is known to the database and the relevant person's permission is granted in the control panel.",
      "startDate": "2018",
      "endDate": "2019",
      "url": "https://www.youtube.com/watch?v=DI_ETO_g7pw"
    }
    
  ]
}
